### Package installation

In [2]:
!pip install psycopg2

Collecting psycopg2

WARNING: You are using pip version 20.1.1; however, version 22.0.3 is available.
You should consider upgrading via the 'c:\python\python.exe -m pip install --upgrade pip' command.

  Downloading psycopg2-2.9.3-cp37-cp37m-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.3

In [3]:
# pip install pandas

In [4]:
#pip install openpyxl

### Package call

In [5]:
import psycopg2
import pandas as pd
import psycopg2.extras

### Extract

***Read from excel file***

In [11]:
DATA_DIR = "D://4th Year//Python Projects//Virtual Internship//ecommerce_csv//"

#### Trans_dim

In [14]:
trans_dim = pd.read_csv(open(DATA_DIR + 'Trans_dim.csv','rb')) #sheet_name=1, engine='openpyxl'
trans_dim.head(5)

  payment_key trans_type                         bank_name
0        P001       cash                              None
1        P002       card                   AB Bank Limited
2        P003       card  Bangladesh Commerce Bank Limited
3        P004       card                 Bank Asia Limited
4        P005       card                 BRAC Bank Limited

#### Store_dim

In [41]:
store_dim = pd.read_csv(open(DATA_DIR + 'Store_dim.csv','rb')) #sheet_name=1, engine='openpyxl'
store_dim.head(5)

  store_key division  district         upazila
0     S0001   SYLHET  HABIGANJ      AJMIRIGANJ
1     S0002   SYLHET  HABIGANJ         BAHUBAL
2     S0003   SYLHET  HABIGANJ      BANIACHONG
3     S0004   SYLHET  HABIGANJ     CHUNARUGHAT
4     S0005   SYLHET  HABIGANJ  HABIGANJ SADAR

#### Coustomer_dim

In [245]:
customer_dim = pd.read_csv(open(DATA_DIR + 'Coustomer_dim.csv','rb')) #sheet_name=1, engine='openpyxl'
customer_dim.head(5)

  coustomer_key             name    contact_no           nid
0       C000001            sumit  8.801920e+12  7.505080e+12
1       C000002         tammanne  8.801817e+12  1.977730e+12
2       C000003    kailash kumar  8.801660e+12  3.769490e+12
3       C000004  bhagwati prasad  8.801534e+12  9.378830e+12
4       C000005             ajay  8.801944e+12  3.540820e+12

#### Item_dim

In [263]:
item_dim = pd.read_csv(open(DATA_DIR + 'Item_dim.csv','rb')) #sheet_name=1, engine='openpyxl'
item_dim.head(5)

,item_key,item_name,desc,unit_price,man_country,supplier,unit
0,I00001,A&W Root Beer - 12 oz cans,a. Beverage - Soda,11.50,Netherlands,Bolsius Boxmeer,cans
1,I00002,A&W Root Beer Diet - 12 oz cans,a. Beverage - Soda,6.75,poland,CHROMADURLIN S.A.S,cans
2,I00003,Barq's Root Beer - 12 oz cans,a. Beverage - Soda,6.75,Bangladesh,DENIMACH LTD,cans
3,I00004,Cherry Coke 12oz,a. Beverage - Soda,6.75,Netherlands,Bolsius Boxmeer,cans
4,I00005,Cherry Coke Zero 12 pack,a. Beverage - Soda,6.75,Finland,HARDFORD AB,cans

#### Time_dim

In [168]:
time_dim = pd.read_csv(open(DATA_DIR + 'Time_dim.csv','rb')) #sheet_name=1, engine='openpyxl'
time_dim.head(5)

  time_key              date  hour  day      week  month quarter  year
0   T00001  20-05-2017 14:56    14   20  3rd Week      5      Q2  2017
1   T00002  30-01-2015 22:14    22   30  4th Week      1      Q1  2015
2   T00003  14-03-2020 02:34     2   14  2nd Week      3      Q1  2020
3   T00004  27-04-2018 12:19    12   27  4th Week      4      Q2  2018
4   T00005  14-04-2018 10:43    10   14  2nd Week      4      Q2  2018

#### Fact_table

In [254]:
fact_data = pd.read_csv(open(DATA_DIR + 'Fact_table.csv','rb')) #sheet_name=1, engine='openpyxl'
fact_data.head(5)

,payment_key,coustomer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price
0,P026,C004510,T049189,I00177,S00307,1,ct,35.0,35.0
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.0,26.0
2,P030,C007261,T03633,I00195,S00496,8,ct,12.5,100.0
3,P032,C007048,T084631,I00131,S0086,8,ct,14.0,112.0
4,P014,C006430,T071276,I00050,S00488,8,cans,8.0,64.0

### Transform

#### Customer_dim

In [99]:
count1 = []
count1.append(customer_dim.coustomer_key.isnull().values.sum())
count1.append(customer_dim.name.isnull().values.sum())
count1.append(customer_dim.contact_no.isnull().values.sum())
count1.append(customer_dim.nid.isnull().values.sum())

In [100]:
missing_value_count_dataset = pd.DataFrame(count1, columns=['Total missing values'])
columns_name = coustomer_dim.columns
missing_value_count_dataset['columns_name'] = columns_name
missing_value_count_dataset

   Total missing values   columns_name
0                     0  coustomer_key
1                    27           name
2                     0     contact_no
3                     0            nid

In [101]:
# before droping the null value total row was 9191
customer_dim.shape

(9191, 4)

In [102]:
# drop the missing values
customer_dim = customer_dim.dropna()

In [103]:
# after droping the null value total row become 9164
customer_dim.shape

(9164, 4)

In [246]:
# remove the '+' sign from the contact number

c = 0
for value in customer_dim["contact_no"].values:
    if(type(value)==float):
        value1 = str(value)
        value1  = value1.replace("+", "")
        # replace the value in the dataset
        customer_dim.contact_no.values[c] = value1
        c = c + 1
    #if(type(value)==float):
    #    value1 = str(value)
        # if value contains ',' or '+' or '.' or '-' or '/' sign or above or Above then remove that sign
        #value1  = value1.replace(",", "")

In [247]:
customer_dim.contact_no.values

array([8.80192000e+12, 8.80181707e+12, 8.80166000e+12, ...,
       8.80189000e+12, 8.80156000e+12, 8.80152000e+12])

#### Time_dim

In [150]:
time_dim.columns

Index(['time_key', 'date', 'hour', 'day', 'week', 'month', 'quarter', 'year'], dtype='object')

In [175]:
time_dim.date = pd.to_datetime(time_dim.date) # format="%d-%m-%Y %H:%M" / format='%Y%m%d',  errors='ignore'
time_dim.date
# s = pd.Timestamp(time_dim.date, '2017-01-01T12') # format="%d-%m-%Y %H:%M" / format='%Y%m%d',  errors='ignore'
# s

0       2017-05-20 14:56:00
1       2015-01-30 22:14:00
2       2020-03-14 02:34:00
3       2018-04-27 12:19:00
4       2018-04-14 10:43:00
                ...
99994   2015-04-01 17:22:00
99995   2015-01-17 21:09:00
99996   2020-01-23 14:42:00
99997   2015-10-31 13:52:00
99998   2017-08-06 08:59:00
Name: date, Length: 99999, dtype: datetime64[ns]

#### Item_dim

In [262]:
item_dim.columns

Index(['item_key', 'item_name', 'desc', 'unit_price', 'man_country',
       'supplier', 'unit'],
      dtype='object')

In [122]:
count1 = []
count1.append(item_dim.item_key.isnull().values.sum())
count1.append(item_dim.item_name.isnull().values.sum())
count1.append(item_dim.desc.isnull().values.sum())
count1.append(item_dim.unit_price.isnull().values.sum())
count1.append(item_dim.man_country.isnull().values.sum())
count1.append(item_dim.supplier.isnull().values.sum())
count1.append(item_dim.unit.isnull().values.sum())

In [123]:
missing_value_count_dataset = pd.DataFrame(count1, columns=['Total missing values'])
columns_name = item_dim.columns
missing_value_count_dataset['columns_name'] = columns_name
missing_value_count_dataset

   Total missing values columns_name
0                     0     item_key
1                     0    item_name
2                     0         desc
3                     0   unit_price
4                     0  man_country
5                     0     supplier
6                     1         unit

In [124]:
item_dim.shape

(264, 7)

In [125]:
# drop the missing values
item_dim = item_dim.dropna()

In [126]:
item_dim.shape

(263, 7)

#### Fact_data

In [273]:
fact_data = pd.read_csv(open(DATA_DIR + 'Fact_table.csv','rb')) #sheet_name=1, engine='openpyxl'
fact_data.head(3)

,payment_key,coustomer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price
0,P026,C004510,T049189,I00177,S00307,1,ct,35.0,35.0
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.0,26.0
2,P030,C007261,T03633,I00195,S00496,8,ct,12.5,100.0

In [230]:
fact_data.columns

Index(['payment_key', 'coustomer_key', 'time_key', 'item_key', 'store_key',
       'quantity', 'unit', 'unit_price', 'total_price'],
      dtype='object')

In [256]:
fact_data.shape

(1000000, 9)

In [240]:
# customer_key=C006321 is not present in table "customer_dim".
# that's why fact_table cann't load this row [customer_key is a foreign key]
# Therefore, this row is dropped from the fact table

i = fact_data[fact_data['coustomer_key'].values == "C006321"].index
i

Int64Index([    68,    279,   7042,  14035,  24086,  30868,  35676,  53038,
             74485,  87128,
            ...
            923627, 943770, 950913, 956857, 958802, 969525, 970108, 973557,
            990482, 996988],
           dtype='int64', length=144)

In [239]:
# customer_key=C006321 is not present in table "customer_dim".
# that's why fact_table cann't load this row [customer_key is a foreign key]
# Therefore, this row is dropped from the fact table

# c = 0
# for value in fact_data["coustomer_key"].values:
#     if(value=="C006321"):
#         # drop the value from the fact_data dataset
#         print(546464)
#         c = c + 1
#         # fact_data.dropna(how: fact_data.coustomer_key.values = 'C006321')
#     print('g')

In [ ]:
fact_data = fact_data.drop(i)

### Load

***Connect to the database***

In [274]:

class PostgresConnection(object):
    def __init__(self):
        self.connection = psycopg2.connect(database="ecomdb",
                                           user = "postgres",
                                           password = "Rsjintu8",
                                           host = "localhost", #"127.0.0.1",
                                           port = "5432")

    def getConnection(self):
        print("successfully connected to database")
        return self.connection

In [275]:
con = PostgresConnection().getConnection()

successfully connected to database

### Trans_dim

In [28]:
# insert values into the trans_dim
insert_stmt = "INSERT INTO ecomdb.trans_dim ( payment_key, trans_type, bank_name)" \
            " VALUES (%s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, trans_dim.values)
con.commit()
cur.close()

In [119]:
cur = con.cursor()
select_stmt = "SELECT payment_key , trans_type, bank_name " \
              "FROM ecomdb.trans_dim"
cur.execute(select_stmt)
records = cur.fetchall()
records

[('P001', 'cash', 'None'),
 ('P002', 'card', 'AB Bank Limited'),
 ('P003', 'card', 'Bangladesh Commerce Bank Limited'),
 ('P004', 'card', 'Bank Asia Limited'),
 ('P005', 'card', 'BRAC Bank Limited'),
 ('P006', 'card', 'Citizens Bank Limited'),
 ('P007', 'card', 'City Bank Limited'),
 ('P008', 'card', 'Community Bank Bangladesh Limited'),
 ('P009', 'card', 'Dhaka Bank Limited'),
 ('P010', 'card', 'Dutch-Bangla Bank Limited'),
 ('P011', 'card', 'Eastern Bank Limited'),
 ('P012', 'card', 'IFIC Bank Limited'),
 ('P013', 'card', 'Jamuna Bank Limited'),
 ('P014', 'card', 'Meghna Bank Limited'),
 ('P015', 'card', 'Mercantile Bank Limited'),
 ('P016', 'card', 'Midland Bank Limited'),
 ('P017', 'card', 'Modhumoti Bank Limited'),
 ('P018', 'card', 'Mutual Trust Bank Limited'),
 ('P019', 'card', 'National Bank Limited'),
 ('P020', 'card', 'National Credit & Commerce Bank Limited'),
 ('P021', 'card', 'NRB Bank Limited'),
 ('P022', 'card', 'NRB Commercial Bank Ltd'),
 ('P023', 'card', 'NRB Global Bank Ltd'),
 ('P024', 'card', 'One Bank Limited'),
 ('P025', 'card', 'Padma Bank Limited'),
 ('P026', 'card', 'Premier Bank Limited'),
 ('P027', 'card', 'Prime Bank Limited'),
 ('P028', 'card', 'Pubali Bank Limited'),
 ('P029', 'card', 'Standard Bank Limited'),
 ('P030', 'card', 'Shimanto Bank Ltd'),
 ('P031', 'card', 'Southeast Bank Limited'),
 ('P032', 'card', 'South Bangla Agriculture and Commerce Bank Limited'),
 ('P033', 'card', 'Trust Bank Limited'),
 ('P034', 'card', 'United Commercial Bank Ltd'),
 ('P035', 'card', 'Uttara Bank Limited'),
 ('P036', 'card', 'Bengal Commercial Bank Ltd'),
 ('P037', 'mobile', 'Bkash'),
 ('P038', 'mobile', 'Rocket'),
 ('P039', 'mobile', 'Nagad')]

In [120]:
trans_df = pd.DataFrame(list(records), columns=['payment_key', 'trans_type', 'bank_name'])
trans_df.head(5)

  payment_key trans_type                         bank_name
0        P001       cash                              None
1        P002       card                   AB Bank Limited
2        P003       card  Bangladesh Commerce Bank Limited
3        P004       card                 Bank Asia Limited
4        P005       card                 BRAC Bank Limited

### Store_dim

In [142]:
store_dim.columns

Index(['store_key', 'division', 'district', 'upazila'], dtype='object')

In [143]:
# insert values into the store_dim
insert_stmt = "INSERT INTO ecomdb.store_dim ( store_key, division, district, upazila)" \
            " VALUES (%s, %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, store_dim.values)
con.commit()
cur.close()

In [144]:
cur = con.cursor()
select_stmt = "SELECT store_key, division, district, upazila " \
              "FROM ecomdb.store_dim"
cur.execute(select_stmt)
records = cur.fetchall()
#records

In [145]:
store_df = pd.DataFrame(list(records), columns=['store_key', 'division', 'district', 'upazila'])
store_df.head(5)

  store_key division  district         upazila
0     S0001   SYLHET  HABIGANJ      AJMIRIGANJ
1     S0002   SYLHET  HABIGANJ         BAHUBAL
2     S0003   SYLHET  HABIGANJ      BANIACHONG
3     S0004   SYLHET  HABIGANJ     CHUNARUGHAT
4     S0005   SYLHET  HABIGANJ  HABIGANJ SADAR

### Customer_dim

In [250]:
customer_dim.columns

Index(['coustomer_key', 'name', 'contact_no', 'nid'], dtype='object')

In [251]:
# insert values into the coustomer_dim
insert_stmt1 = "INSERT INTO ecomdb.customer_dim ( customer_key, name, contact_no, nid)" \
            " VALUES (%s, %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt1, customer_dim.values)
con.commit()
cur.close()

In [252]:
cur = con.cursor()
select_stmt = "SELECT customer_key, name, contact_no, nid " \
              "FROM ecomdb.customer_dim"
cur.execute(select_stmt)
records = cur.fetchall()
#records

In [253]:
customer_df = pd.DataFrame(list(records), columns=['coustomer_key', 'name', 'contact_no', 'nid'])
customer_df.head(5)

  coustomer_key             name     contact_no            nid
0       C000001            sumit  8801920000000  7505080000000
1       C000002         tammanne  8801817069329  1977730000000
2       C000003    kailash kumar  8801660000000  3769490000000
3       C000004  bhagwati prasad  8801533627961  9378830000000
4       C000005             ajay  8801943715786  3540820000000

### Item_dim

In [266]:
item_dim.columns

Index(['item_key', 'item_name', 'desc', 'unit_price', 'man_country',
       'supplier', 'unit'],
      dtype='object')

In [270]:
# insert values into the item_dim
insert_stmt = "INSERT INTO ecomdb.item_dim ( item_key, item_name, descs, unit_price, man_country, supplier, unit)" \
            " VALUES (%s, %s, %s, %s, %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, item_dim.values)
con.commit()
cur.close()

In [271]:
cur = con.cursor()
select_stmt = "SELECT item_key, item_name, descs, unit_price, man_country, supplier, unit " \
              "FROM ecomdb.item_dim"
cur.execute(select_stmt)
records = cur.fetchall()
#records

In [272]:
item_df = pd.DataFrame(list(records), columns=['item_key', 'item_name', 'desc', 'unit_price', 'man_country',
       'supplier', 'unit'])
item_df.head(5)

,item_key,item_name,desc,unit_price,man_country,supplier,unit
0,I00001,A&W Root Beer - 12 oz cans,a. Beverage - Soda,11.50,Netherlands,Bolsius Boxmeer,cans
1,I00002,A&W Root Beer Diet - 12 oz cans,a. Beverage - Soda,6.75,poland,CHROMADURLIN S.A.S,cans
2,I00003,Barq's Root Beer - 12 oz cans,a. Beverage - Soda,6.75,Bangladesh,DENIMACH LTD,cans
3,I00004,Cherry Coke 12oz,a. Beverage - Soda,6.75,Netherlands,Bolsius Boxmeer,cans
4,I00005,Cherry Coke Zero 12 pack,a. Beverage - Soda,6.75,Finland,HARDFORD AB,cans

### Time_dim

In [176]:
time_dim.columns

Index(['time_key', 'date', 'hour', 'day', 'week', 'month', 'quarter', 'year'], dtype='object')

In [180]:
# insert values into the time_dim
insert_stmt = "INSERT INTO ecomdb.time_dim (time_key, datee, hour, day, week, month, quarter, year)" \
            " VALUES (%s, %s, %s, %s, %s, %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, time_dim.values)
con.commit()
cur.close()

In [183]:
con = PostgresConnection().getConnection()
cur = con.cursor()
select_stmt = "SELECT time_key, datee, hour, day, week, month, quarter, year " \
              "FROM ecomdb.time_dim"
cur.execute(select_stmt)
records = cur.fetchall()
#records

successfully connected to database

In [184]:
time_df = pd.DataFrame(list(records), columns=['time_key', 'date', 'hour', 'day', 'week', 'month', 'quarter', 'year'])
time_df.head(5)

  time_key                date  hour  day      week  month quarter  year
0   T00001 2017-05-20 14:56:00    14   20  3rd Week      5      Q2  2017
1   T00002 2015-01-30 22:14:00    22   30  4th Week      1      Q1  2015
2   T00003 2020-03-14 02:34:00     2   14  2nd Week      3      Q1  2020
3   T00004 2018-04-27 12:19:00    12   27  4th Week      4      Q2  2018
4   T00005 2018-04-14 10:43:00    10   14  2nd Week      4      Q2  2018

### Fact_data

In [259]:
fact_data.columns

Index(['payment_key', 'coustomer_key', 'time_key', 'item_key', 'store_key',
       'quantity', 'unit', 'unit_price', 'total_price'],
      dtype='object')

In [276]:
# insert values into the fact_table
insert_stmt = "INSERT INTO ecomdb.fact_table (payment_key, customer_key, time_key, item_key, store_key, quantity, unit, unit_price, total_price)" \
            " VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
con.commit()
cur.close()

In [278]:
con = PostgresConnection().getConnection()
cur = con.cursor()
select_stmt = "SELECT payment_key, customer_key, time_key, item_key, store_key, quantity, unit, unit_price, total_price " \
              "FROM ecomdb.fact_table"
cur.execute(select_stmt)
records = cur.fetchall()
#records

successfully connected to database

In [279]:
fact_df = pd.DataFrame(list(records), columns=['payment_key', 'coustomer_key', 'time_key', 'item_key', 'store_key',
       'quantity', 'unit', 'unit_price', 'total_price'])
fact_df.head(5)

,payment_key,coustomer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price
0,P026,C004510,T049189,I00177,S00307,1,ct,35.00,35.00
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.00,26.00
2,P030,C007261,T03633,I00195,S00496,8,ct,12.50,100.00
3,P032,C007048,T084631,I00131,S0086,8,ct,14.00,112.00
4,P014,C006430,T071276,I00050,S00488,8,cans,8.00,64.00